STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E-EV/stm32l552e_eval_audio.c
/* Audio in DFSDM internal buffers and global varibales */
int32_t  Audio_DigMic1RecBuff[BSP_AUDIO_IN_DEFAULT_BUFFER_SIZE];
int32_t  Audio_DigMic2RecBuff[BSP_AUDIO_IN_DEFAULT_BUFFER_SIZE];
uint32_t Audio_DmaDigMic1RecHalfBuffCplt;
uint32_t Audio_DmaDigMic1RecBuffCplt;
uint32_t Audio_DmaDigMic2RecHalfBuffCplt;
uint32_t Audio_DmaDigMic2RecBuffCplt;
/**
  * @}
  */

/** @defgroup STM32L552E-EV_AUDIO_Private_Variables STM32L552E-EV AUDIO Private Variables
  * @{
  */
/* Audio in and out DMA handles used by SAI */
static DMA_HandleTypeDef hDmaSaiTx, hDmaSaiRx;

/* Audio in DMA handles used by DFSDM */
static DMA_HandleTypeDef hDmaDfsdm[2];        

#if ((USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) || (USE_HAL_SAI_REGISTER_CALLBACKS == 1))
static uint32_t AudioOut_IsMspCbValid[AUDIO_OUT_INSTANCES_NBR] = {0};
static uint32_t AudioIn_IsMspCbValid[AUDIO_IN_INSTANCES_NBR] = {0, 0};
#endif
/**
  * @}
  */ 

/** @defgroup STM32L552E-EV_AUDIO_Private_Function_Prototypes STM32L552E-EV AUDIO Private Function Prototypes
  * @{
  */
static int32_t CS42L51_Probe(void);
static int32_t CS42L51_PowerUp(void);
static int32_t CS42L51_PowerDown(void);
static void    SAI_MspInit(SAI_HandleTypeDef *hsai);
static void    SAI_MspDeInit(SAI_HandleTypeDef *hsai);
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
static void    SAI_TxCpltCallback(SAI_HandleTypeDef *hsai);
static void    SAI_TxHalfCpltCallback(SAI_HandleTypeDef *hsai);
static void    SAI_RxCpltCallback(SAI_HandleTypeDef *hsai);
static void    SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai);
static void    SAI_ErrorCallback(SAI_HandleTypeDef *hsai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */

static int32_t DFSDM_DeInit(DFSDM_Filter_HandleTypeDef *hDfsdmFilter, DFSDM_Channel_HandleTypeDef *hDfsdmChannel);
static void    DFSDM_ChannelMspInit(DFSDM_Channel_HandleTypeDef *hdfsdm_channel);
static void    DFSDM_ChannelMspDeInit(DFSDM_Channel_HandleTypeDef *hdfsdm_channel);
static void    DFSDM_FilterMspInit(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
static void    DFSDM_FilterMspDeInit(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
static void    DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
static void    DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
static void    DFSDM_FilterErrorCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
/**
  * @}
  */

/** @addtogroup STM32L552E-EV_AUDIO_OUT_Exported_Functions
  * @{
  */
/**
  * @brief  Initialize the audio out peripherals.
  * @param  Instance Audio out instance.
  * @param  AudioInit Audio out init structure.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_Init(uint32_t Instance, BSP_AUDIO_Init_t *AudioInit)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if ((Instance == 0U) && ((AudioInit->BitsPerSample == AUDIO_RESOLUTION_32b) || (AudioInit->BitsPerSample == AUDIO_RESOLUTION_8b)))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Instance == 0U) && (Audio_In_Ctx[0].State != AUDIO_IN_STATE_RESET) && 
          ((Audio_In_Ctx[0].SampleRate != AudioInit->SampleRate) || (Audio_In_Ctx[0].BitsPerSample != AudioInit->BitsPerSample)))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Instance == 0U) && (Audio_In_Ctx[1].State != AUDIO_IN_STATE_RESET) && 
           (Audio_In_Ctx[1].SampleRate != AudioInit->SampleRate))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if (Audio_Out_Ctx[Instance].State != AUDIO_OUT_STATE_RESET)
  {
    status = BSP_ERROR_BUSY;
  }
  else
  {
    /* Un-reset audio codec if not currently used by audio out instance 0 */
    if (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
    {
      if (CS42L51_PowerUp() != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

    if (status == BSP_ERROR_NONE)
    {
      /* Fill audio out context structure */
      Audio_Out_Ctx[Instance].Device         = AudioInit->Device;
      Audio_Out_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
      Audio_Out_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
      Audio_Out_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
      Audio_Out_Ctx[Instance].Volume         = AudioInit->Volume;

      /* Probe the audio codec */
      if (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
      {
        if (CS42L51_Probe() != BSP_ERROR_NONE)
        {
          status = BSP_ERROR_COMPONENT_FAILURE;
        }
      }

      if (status == BSP_ERROR_NONE)
      {
        /* Set SAI instance */
        haudio_out_sai.Instance = SAI1_Block_B;

        /* Configure the SAI PLL according to the requested audio frequency if not already done by other instances */
        if ((Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET) && (Audio_In_Ctx[1].State == AUDIO_IN_STATE_RESET))
        {
          if (MX_SAI1_ClockConfig(&haudio_out_sai, AudioInit->SampleRate) != HAL_OK)
          {
            status = BSP_ERROR_CLOCK_FAILURE;
          }
        }

        if (status == BSP_ERROR_NONE)
        {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
          SAI_MspInit(&haudio_out_sai);
#else
          /* Register the SAI MSP Callbacks */
          if (AudioOut_IsMspCbValid[Instance] == 0U)
          {
            if (BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
          }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
        }

        if (status == BSP_ERROR_NONE)
        {
          /* Prepare SAI peripheral initialization */
          MX_SAI_InitTypeDef mxSaiInit;
          mxSaiInit.AudioFrequency    = AudioInit->SampleRate;
          mxSaiInit.AudioMode         = SAI_MODEMASTER_TX;
          mxSaiInit.ClockStrobing     = SAI_CLOCKSTROBING_FALLINGEDGE;
          mxSaiInit.MonoStereoMode    = (AudioInit->ChannelsNbr == 1U) ? SAI_MONOMODE : SAI_STEREOMODE;
          if (AudioInit->BitsPerSample == AUDIO_RESOLUTION_24b)
          {
            mxSaiInit.DataSize          = SAI_DATASIZE_24;
            mxSaiInit.FrameLength       = 64;
            mxSaiInit.ActiveFrameLength = 32;
          }
          else
          {
            mxSaiInit.DataSize          = SAI_DATASIZE_16;
            mxSaiInit.FrameLength       = 32;
            mxSaiInit.ActiveFrameLength = 16;
          }
          mxSaiInit.OutputDrive       = SAI_OUTPUTDRIVE_ENABLE;
          mxSaiInit.Synchro           = SAI_ASYNCHRONOUS;
          mxSaiInit.SynchroExt        = SAI_SYNCEXT_DISABLE;
          mxSaiInit.SlotActive        = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

          /* SAI peripheral initialization */
          if (MX_SAI1_Init(&haudio_out_sai, &mxSaiInit) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)    
          /* Register SAI TC, HT and Error callbacks */
          else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_COMPLETE_CB_ID, SAI_TxCpltCallback) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
          else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_HALFCOMPLETE_CB_ID, SAI_TxHalfCpltCallback) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
          else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
          else
          {
            /* Initialize audio codec */
            CS42L51_Init_t codec_init;
            codec_init.InputDevice  = (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET) ? CS42L51_IN_NONE : CS42L51_IN_MIC1;
            codec_init.OutputDevice = CS42L51_OUT_HEADPHONE;
            codec_init.Frequency    = AudioInit->SampleRate;
            codec_init.Resolution   = CS42L51_RESOLUTION_16b; /* Not used */
            codec_init.Volume       = AudioInit->Volume;
            if (Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
            {
              status = BSP_ERROR_COMPONENT_FAILURE;
            }
            else
            {
              /* Update audio out context state */
              Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_STOP;
            }
          }
        }
      }
    }
  }
  return status;
}

/**
  * @brief  De-initialize the audio out peripherals.
  * @param  Instance Audio out instance.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_DeInit(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

