STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E-EV/stm32l552e_eval_audio.c
  return status;
}

/**
  * @brief  Initialize SAI1.
  * @param  hsai SAI handle.
  * @param  MXInit SAI configuration structure.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_SAI1_Init(SAI_HandleTypeDef* hsai, MX_SAI_InitTypeDef *MXInit)
{ 
  HAL_StatusTypeDef status = HAL_OK;

  if ((hsai->Instance == SAI1_Block_B) || (hsai->Instance == SAI1_Block_A))
  {
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE(hsai);
  
    /* Configure SAI1_Block_B */
    hsai->Init.MonoStereoMode       = MXInit->MonoStereoMode;
    hsai->Init.AudioFrequency       = MXInit->AudioFrequency;
    hsai->Init.AudioMode            = MXInit->AudioMode;
    hsai->Init.NoDivider            = SAI_MASTERDIVIDER_ENABLE;
    hsai->Init.Protocol             = SAI_FREE_PROTOCOL;
    hsai->Init.DataSize             = MXInit->DataSize;
    hsai->Init.FirstBit             = SAI_FIRSTBIT_MSB;
    hsai->Init.ClockStrobing        = MXInit->ClockStrobing;
    hsai->Init.Synchro              = MXInit->Synchro;
    hsai->Init.OutputDrive          = MXInit->OutputDrive;
    hsai->Init.FIFOThreshold        = SAI_FIFOTHRESHOLD_1QF;
    hsai->Init.SynchroExt           = MXInit->SynchroExt;
    hsai->Init.CompandingMode       = SAI_NOCOMPANDING;
    hsai->Init.TriState             = SAI_OUTPUT_NOTRELEASED;
    hsai->Init.Mckdiv               = 0U;
    hsai->Init.MckOutput            = SAI_MCK_OUTPUT_ENABLE;
    hsai->Init.MckOverSampling      = SAI_MCK_OVERSAMPLING_DISABLE;
    hsai->Init.PdmInit.Activation   = DISABLE;

    /* Configure SAI1_Block_B Frame */
    hsai->FrameInit.FrameLength       = MXInit->FrameLength; 
    hsai->FrameInit.ActiveFrameLength = MXInit->ActiveFrameLength;  
    hsai->FrameInit.FSDefinition      = SAI_FS_CHANNEL_IDENTIFICATION;
    hsai->FrameInit.FSPolarity        = SAI_FS_ACTIVE_LOW;
    hsai->FrameInit.FSOffset          = SAI_FS_BEFOREFIRSTBIT;

    /* Configure SAI1_Block_B Slot */
    hsai->SlotInit.FirstBitOffset     = 0;
    if ((MXInit->DataSize == AUDIO_RESOLUTION_24b) || (MXInit->DataSize == AUDIO_RESOLUTION_32b))
    {
      hsai->SlotInit.SlotSize         = SAI_SLOTSIZE_32B;
    }
    else
    {
      hsai->SlotInit.SlotSize         = SAI_SLOTSIZE_16B;
    }
    hsai->SlotInit.SlotNumber         = 2;
    hsai->SlotInit.SlotActive         = MXInit->SlotActive;

    if(HAL_SAI_Init(hsai) != HAL_OK)
    {
      status = HAL_ERROR;
    }
  }  
  return status;
}
/**
  * @}
  */ 

/** @addtogroup STM32L552E-EV_AUDIO_IN_Exported_Functions
  * @{
  */
/**
  * @brief  Initialize the audio in peripherals.
  * @param  Instance Audio in instance.
  * @param  AudioInit Audio in init structure.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_IN_Init(uint32_t Instance, BSP_AUDIO_Init_t *AudioInit)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_RESET)
  {
    status = BSP_ERROR_BUSY;
  }
  else if (AudioInit->BitsPerSample != AUDIO_RESOLUTION_16b)
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if (((Instance == 0U) && (AudioInit->ChannelsNbr != 1U)) ||
           ((Instance == 1U) && (AudioInit->Device == AUDIO_IN_DIGITAL_MIC) && (AudioInit->ChannelsNbr != 2U)) ||
           ((Instance == 1U) && (AudioInit->Device == AUDIO_IN_DIGITAL_MIC1) && (AudioInit->ChannelsNbr != 1U)) ||
           ((Instance == 1U) && (AudioInit->Device == AUDIO_IN_DIGITAL_MIC2) && (AudioInit->ChannelsNbr != 1U)))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_RESET) && (Audio_Out_Ctx[0].SampleRate != AudioInit->SampleRate))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Instance == 0U) && (Audio_In_Ctx[1].State != AUDIO_IN_STATE_RESET) && (Audio_In_Ctx[1].SampleRate != AudioInit->SampleRate))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Instance == 1U) && (Audio_In_Ctx[0].State != AUDIO_IN_STATE_RESET) && (Audio_In_Ctx[0].SampleRate != AudioInit->SampleRate))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Instance == 0U) && (Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_RESET) && 
           (Audio_Out_Ctx[0].BitsPerSample != AudioInit->BitsPerSample))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else
  {
    if (Instance == 0U)
    {
      /* Un-reset audio codec if not currently used by audio out instance 0 */
      if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
      {
        if (CS42L51_PowerUp() != BSP_ERROR_NONE)
        {
          status = BSP_ERROR_COMPONENT_FAILURE;
        }
      }
    
      if (status == BSP_ERROR_NONE)
      {
        /* Fill audio in context structure */
        Audio_In_Ctx[Instance].Device         = AudioInit->Device;
        Audio_In_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
        Audio_In_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
        Audio_In_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
        Audio_In_Ctx[Instance].Volume         = AudioInit->Volume;

        /* Probe the audio codec */
        if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
        {
          if (CS42L51_Probe() != BSP_ERROR_NONE)
          {
            status = BSP_ERROR_COMPONENT_FAILURE;
          }
        }

        if (status == BSP_ERROR_NONE)
        {
          /* Set SAI instances (SAI1_Block_B needed for MCLK, FS and CLK signals) */
          haudio_in_sai.Instance  = SAI1_Block_A;
          haudio_out_sai.Instance = SAI1_Block_B;

          /* Configure the SAI PLL according to the requested audio frequency if not already done by other instances */
          if ((Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) && (Audio_In_Ctx[1].State == AUDIO_IN_STATE_RESET))
          {
            if (MX_SAI1_ClockConfig(&haudio_in_sai, AudioInit->SampleRate) != HAL_OK)
            {
              status = BSP_ERROR_CLOCK_FAILURE;
            }
          }

          if (status == BSP_ERROR_NONE)
          {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
            SAI_MspInit(&haudio_in_sai);
            if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
            {
              SAI_MspInit(&haudio_out_sai);
            }
#else
            /* Register the SAI MSP Callbacks */
            if (AudioIn_IsMspCbValid[Instance] == 0U)
            {
              if (BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
            }
            if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
            {
              if (AudioOut_IsMspCbValid[0] == 0U)
              {
                if (BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
                {
                  status = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#endif /* #if (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
          }

          if (status == BSP_ERROR_NONE)
          {
            /* Prepare SAI peripheral initialization */
            MX_SAI_InitTypeDef mxSaiInit;
            mxSaiInit.AudioFrequency    = AudioInit->SampleRate;
            mxSaiInit.AudioMode         = SAI_MODESLAVE_RX;
            mxSaiInit.ClockStrobing     = SAI_CLOCKSTROBING_FALLINGEDGE;
            mxSaiInit.MonoStereoMode    = SAI_MONOMODE;
            mxSaiInit.DataSize          = SAI_DATASIZE_16;
            mxSaiInit.FrameLength       = 32;
            mxSaiInit.ActiveFrameLength = 16;
            mxSaiInit.OutputDrive       = SAI_OUTPUTDRIVE_ENABLE;
            mxSaiInit.Synchro           = SAI_SYNCHRONOUS;
            mxSaiInit.SynchroExt        = SAI_SYNCEXT_DISABLE;
            mxSaiInit.SlotActive        = SAI_SLOTACTIVE_0;

            /* SAI peripheral initialization */
            if (MX_SAI1_Init(&haudio_in_sai, &mxSaiInit) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
              {
                /* Initialize SAI peripheral used to generate clock and synchro */
                mxSaiInit.AudioMode  = SAI_MODEMASTER_TX;
                mxSaiInit.Synchro    = SAI_ASYNCHRONOUS;
                mxSaiInit.SlotActive = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;
                if (MX_SAI1_Init(&haudio_out_sai, &mxSaiInit) != HAL_OK)
                {
                  status = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)    
            if (status == BSP_ERROR_NONE)
            {
              /* Register SAI TC, HT and Error callbacks */
              if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_COMPLETE_CB_ID, SAI_RxCpltCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_HALFCOMPLETE_CB_ID, SAI_RxHalfCpltCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
                {
                  status = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
            if (status == BSP_ERROR_NONE)
            {
              /* Initialize audio codec */
              CS42L51_Init_t codec_init;
              codec_init.InputDevice  = CS42L51_IN_MIC1;
              codec_init.OutputDevice = (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) ? CS42L51_OUT_NONE : CS42L51_OUT_HEADPHONE;
              codec_init.Frequency    = AudioInit->SampleRate;
              codec_init.Resolution   = CS42L51_RESOLUTION_16b; /* Not used */
              codec_init.Volume       = Audio_Out_Ctx[0].Volume;
              if (Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
              {
                status = BSP_ERROR_COMPONENT_FAILURE;
              }
              else
              {
                /* Update audio in context state */
                Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_STOP;
              }
            }
          }
        }
      }
    }
    else /* Instance = 1 */
    {
      /* Fill audio in context structure */
      Audio_In_Ctx[Instance].Device         = AudioInit->Device;
      Audio_In_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
      Audio_In_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
      Audio_In_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
      Audio_In_Ctx[Instance].Volume         = AudioInit->Volume;

      /* Set DFSDM instances */
      haudio_in_dfsdm_channel[0].Instance = DFSDM1_Channel1;
      haudio_in_dfsdm_channel[1].Instance = DFSDM1_Channel0;
      haudio_in_dfsdm_filter[0].Instance  = DFSDM1_Filter0;
      haudio_in_dfsdm_filter[1].Instance  = DFSDM1_Filter1;

      /* Configure DFSDM clock according to the requested audio frequency */
      if (MX_DFSDM1_ClockConfig(&haudio_in_dfsdm_channel[0], AudioInit->SampleRate) != HAL_OK)
      {
        status = BSP_ERROR_CLOCK_FAILURE;
      }
      else
      {
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0)      
        if ((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC1) == AUDIO_IN_DIGITAL_MIC1)
        {
          DFSDM_ChannelMspInit(&haudio_in_dfsdm_channel[0]);
          DFSDM_FilterMspInit(&haudio_in_dfsdm_filter[0]);
        }
        if ((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC2) == AUDIO_IN_DIGITAL_MIC2)
        {
          DFSDM_ChannelMspInit(&haudio_in_dfsdm_channel[1]);
          DFSDM_FilterMspInit(&haudio_in_dfsdm_filter[1]);
        }
#else
        /* Register the DFSDM MSP Callbacks */
        if(AudioIn_IsMspCbValid[Instance] == 0U)
        {
          if(BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
        }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0) */
        if (status == BSP_ERROR_NONE)
        {
          /* Prepare DFSDM peripheral initialization */
          MX_DFSDM_InitTypeDef mxDfsdmInit;
          if ((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC1) == AUDIO_IN_DIGITAL_MIC1)
          {
            mxDfsdmInit.ChannelInstance = DFSDM1_Channel1;
            mxDfsdmInit.ClockDivider    = DFSDM_CLOCK_DIVIDER(Audio_In_Ctx[Instance].SampleRate);
            mxDfsdmInit.DigitalMicPins  = DFSDM_CHANNEL_SAME_CHANNEL_PINS;
            mxDfsdmInit.DigitalMicType  = DFSDM_CHANNEL_SPI_FALLING;
            mxDfsdmInit.RightBitShift   = DFSDM_MIC_BIT_SHIFT(Audio_In_Ctx[Instance].SampleRate);
            mxDfsdmInit.Channel4Filter  = DFSDM_CHANNEL_1;
            mxDfsdmInit.FilterInstance  = DFSDM1_Filter0;
            mxDfsdmInit.RegularTrigger  = DFSDM_FILTER_SW_TRIGGER;
            mxDfsdmInit.SincOrder       = DFSDM_FILTER_ORDER(Audio_In_Ctx[Instance].SampleRate);
            mxDfsdmInit.Oversampling    = DFSDM_OVER_SAMPLING(Audio_In_Ctx[Instance].SampleRate);
            if (MX_DFSDM1_Init(&haudio_in_dfsdm_filter[0], &haudio_in_dfsdm_channel[0], &mxDfsdmInit) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)    
            if (status == BSP_ERROR_NONE)
            {
              /* Register DFSDM filter TC, HT and Error callbacks */
              if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[0], HAL_DFSDM_FILTER_REGCONV_COMPLETE_CB_ID, DFSDM_FilterRegConvCpltCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[0], HAL_DFSDM_FILTER_REGCONV_HALFCOMPLETE_CB_ID, DFSDM_FilterRegConvHalfCpltCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[0], HAL_DFSDM_FILTER_ERROR_CB_ID, DFSDM_FilterErrorCallback) != HAL_OK)
                {
                  status = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */          
          }
          if (((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC2) == AUDIO_IN_DIGITAL_MIC2) && (status == BSP_ERROR_NONE))
          {
            mxDfsdmInit.ChannelInstance = DFSDM1_Channel0;
            mxDfsdmInit.ClockDivider    = DFSDM_CLOCK_DIVIDER(Audio_In_Ctx[Instance].SampleRate);
            mxDfsdmInit.DigitalMicPins  = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
            mxDfsdmInit.DigitalMicType  = DFSDM_CHANNEL_SPI_RISING;
            mxDfsdmInit.RightBitShift   = DFSDM_MIC_BIT_SHIFT(Audio_In_Ctx[Instance].SampleRate);
            mxDfsdmInit.Channel4Filter  = DFSDM_CHANNEL_0;
            mxDfsdmInit.FilterInstance  = DFSDM1_Filter1;
            if (Audio_In_Ctx[Instance].Device == AUDIO_IN_DIGITAL_MIC2)
            {
              mxDfsdmInit.RegularTrigger  = DFSDM_FILTER_SW_TRIGGER;
            }
            else
            {
              mxDfsdmInit.RegularTrigger  = DFSDM_FILTER_SYNC_TRIGGER;
            }
            mxDfsdmInit.SincOrder       = DFSDM_FILTER_ORDER(Audio_In_Ctx[Instance].SampleRate);
            mxDfsdmInit.Oversampling    = DFSDM_OVER_SAMPLING(Audio_In_Ctx[Instance].SampleRate);
            if (MX_DFSDM1_Init(&haudio_in_dfsdm_filter[1], &haudio_in_dfsdm_channel[1], &mxDfsdmInit) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
            if (status == BSP_ERROR_NONE)
            {
              /* Register DFSDM filter TC, HT and Error callbacks */
              if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[1], HAL_DFSDM_FILTER_REGCONV_COMPLETE_CB_ID, DFSDM_FilterRegConvCpltCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[1], HAL_DFSDM_FILTER_REGCONV_HALFCOMPLETE_CB_ID, DFSDM_FilterRegConvHalfCpltCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[1], HAL_DFSDM_FILTER_ERROR_CB_ID, DFSDM_FilterErrorCallback) != HAL_OK)
                {
                  status = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */          
          }
          if (status == BSP_ERROR_NONE)
          {
            /* Initialise transfer control flag */
            Audio_DmaDigMic1RecHalfBuffCplt = 0;
            Audio_DmaDigMic1RecBuffCplt     = 0;
            Audio_DmaDigMic2RecHalfBuffCplt = 0;
            Audio_DmaDigMic2RecBuffCplt     = 0;

