STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E-EV/stm32l552e_eval_audio.c
        /* DeInitialize DFSDM */
        if ((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC2) == AUDIO_IN_DIGITAL_MIC2)
        {
          if (DFSDM_DeInit(&haudio_in_dfsdm_filter[1], &haudio_in_dfsdm_channel[1]) != BSP_ERROR_NONE)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0)
          else
          {
            DFSDM_FilterMspDeInit(&haudio_in_dfsdm_filter[1]);
            DFSDM_ChannelMspDeInit(&haudio_in_dfsdm_channel[1]);
          }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0) */
        }
        if (((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC1) == AUDIO_IN_DIGITAL_MIC1) && (status == BSP_ERROR_NONE))
        {
          if (DFSDM_DeInit(&haudio_in_dfsdm_filter[0], &haudio_in_dfsdm_channel[0]) != BSP_ERROR_NONE)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0)
          else
          {
            DFSDM_FilterMspDeInit(&haudio_in_dfsdm_filter[0]);
            DFSDM_ChannelMspDeInit(&haudio_in_dfsdm_channel[0]);
          }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0) */
        }

        /* ReInitialize DFSDM with new sample rate */
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0)      
        if (((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC1) == AUDIO_IN_DIGITAL_MIC1) && (status == BSP_ERROR_NONE))
        {
          DFSDM_ChannelMspInit(&haudio_in_dfsdm_channel[0]);
          DFSDM_FilterMspInit(&haudio_in_dfsdm_filter[0]);
        }
        if (((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC2) == AUDIO_IN_DIGITAL_MIC2) && (status == BSP_ERROR_NONE))
        {
          DFSDM_ChannelMspInit(&haudio_in_dfsdm_channel[1]);
          DFSDM_FilterMspInit(&haudio_in_dfsdm_filter[1]);
        }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0) */
        if (((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC1) == AUDIO_IN_DIGITAL_MIC1) && (status == BSP_ERROR_NONE))
        {
          mxDfsdmInit.ChannelInstance = DFSDM1_Channel1;
          mxDfsdmInit.ClockDivider    = DFSDM_CLOCK_DIVIDER(SampleRate);
          mxDfsdmInit.DigitalMicPins  = DFSDM_CHANNEL_SAME_CHANNEL_PINS;
          mxDfsdmInit.DigitalMicType  = DFSDM_CHANNEL_SPI_FALLING;
          mxDfsdmInit.RightBitShift   = DFSDM_MIC_BIT_SHIFT(SampleRate);
          mxDfsdmInit.Channel4Filter  = DFSDM_CHANNEL_1;
          mxDfsdmInit.FilterInstance  = DFSDM1_Filter0;
          mxDfsdmInit.RegularTrigger  = DFSDM_FILTER_SW_TRIGGER;
          mxDfsdmInit.SincOrder       = DFSDM_FILTER_ORDER(SampleRate);
          mxDfsdmInit.Oversampling    = DFSDM_OVER_SAMPLING(SampleRate);
          if (MX_DFSDM1_Init(&haudio_in_dfsdm_filter[0], &haudio_in_dfsdm_channel[0], &mxDfsdmInit) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)    
          if (status == BSP_ERROR_NONE)
          {
            /* Register DFSDM filter TC, HT and Error callbacks */
            if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[0], HAL_DFSDM_FILTER_REGCONV_COMPLETE_CB_ID, DFSDM_FilterRegConvCpltCallback) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
            else if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[0], HAL_DFSDM_FILTER_REGCONV_HALFCOMPLETE_CB_ID, DFSDM_FilterRegConvHalfCpltCallback) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[0], HAL_DFSDM_FILTER_ERROR_CB_ID, DFSDM_FilterErrorCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */          
        }
        if (((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC2) == AUDIO_IN_DIGITAL_MIC2) && (status == BSP_ERROR_NONE))
        {
          mxDfsdmInit.ChannelInstance = DFSDM1_Channel0;
          mxDfsdmInit.ClockDivider    = DFSDM_CLOCK_DIVIDER(SampleRate);
          mxDfsdmInit.DigitalMicPins  = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
          mxDfsdmInit.DigitalMicType  = DFSDM_CHANNEL_SPI_RISING;
          mxDfsdmInit.RightBitShift   = DFSDM_MIC_BIT_SHIFT(SampleRate);
          mxDfsdmInit.Channel4Filter  = DFSDM_CHANNEL_0;
          mxDfsdmInit.FilterInstance  = DFSDM1_Filter1;
          if (Audio_In_Ctx[Instance].Device == AUDIO_IN_DIGITAL_MIC2)
          {
            mxDfsdmInit.RegularTrigger  = DFSDM_FILTER_SW_TRIGGER;
          }
          else
          {
            mxDfsdmInit.RegularTrigger  = DFSDM_FILTER_SYNC_TRIGGER;
          }
          mxDfsdmInit.SincOrder       = DFSDM_FILTER_ORDER(SampleRate);
          mxDfsdmInit.Oversampling    = DFSDM_OVER_SAMPLING(SampleRate);
          if (MX_DFSDM1_Init(&haudio_in_dfsdm_filter[1], &haudio_in_dfsdm_channel[1], &mxDfsdmInit) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
          if (status == BSP_ERROR_NONE)
          {
            /* Register DFSDM filter TC, HT and Error callbacks */
            if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[1], HAL_DFSDM_FILTER_REGCONV_COMPLETE_CB_ID, DFSDM_FilterRegConvCpltCallback) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
            else if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[1], HAL_DFSDM_FILTER_REGCONV_HALFCOMPLETE_CB_ID, DFSDM_FilterRegConvHalfCpltCallback) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if (HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[1], HAL_DFSDM_FILTER_ERROR_CB_ID, DFSDM_FilterErrorCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */          
        }
      }
      /* Store new sample rate on audio in context */
      if (status == BSP_ERROR_NONE)
      {
        Audio_In_Ctx[Instance].SampleRate = SampleRate;
      }  
    }
  }
  return status;
}

/**
  * @brief  Get audio in sample rate.
  * @param  Instance Audio in instance.
  * @param  SampleRate Pointer to sample rate of the audio in stream.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_IN_GetSampleRate(uint32_t Instance, uint32_t *SampleRate)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State == AUDIO_IN_STATE_RESET)
  {
    status = BSP_ERROR_BUSY;
  }
  /* Get the current audio in sample rate */
  else
  {
    *SampleRate = Audio_In_Ctx[Instance].SampleRate;
  }
  return status;
}

/**
  * @brief  Set audio in device.
  * @param  Instance Audio in instance.
  * @param  Device Device of the audio in stream.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_IN_SetDevice(uint32_t Instance, uint32_t Device)
{
  int32_t status = BSP_ERROR_NONE;

  UNUSED(Device);

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_STOP)
  {
    status = BSP_ERROR_BUSY;
  }
  else if (Audio_In_Ctx[Instance].Device != Device)
  {
    if (Instance == 1U)
    {
      MX_DFSDM_InitTypeDef mxDfsdmInit;

      /* DeInitialize DFSDM for previous microphones */
      if ((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC2) == AUDIO_IN_DIGITAL_MIC2)
      {
        if (DFSDM_DeInit(&haudio_in_dfsdm_filter[1], &haudio_in_dfsdm_channel[1]) != BSP_ERROR_NONE)
        {
          status = BSP_ERROR_PERIPH_FAILURE;
        }
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0)
        else
        {
          DFSDM_FilterMspDeInit(&haudio_in_dfsdm_filter[1]);
          DFSDM_ChannelMspDeInit(&haudio_in_dfsdm_channel[1]);
        }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0) */
      }
      if (((Audio_In_Ctx[Instance].Device & AUDIO_IN_DIGITAL_MIC1) == AUDIO_IN_DIGITAL_MIC1) && (status == BSP_ERROR_NONE))
      {
        if (DFSDM_DeInit(&haudio_in_dfsdm_filter[0], &haudio_in_dfsdm_channel[0]) != BSP_ERROR_NONE)
        {
          status = BSP_ERROR_PERIPH_FAILURE;
        }
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0)
        else
        {
          DFSDM_FilterMspDeInit(&haudio_in_dfsdm_filter[0]);
          DFSDM_ChannelMspDeInit(&haudio_in_dfsdm_channel[0]);
        }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0) */
      }

