STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E-EV/stm32l552e_eval_audio.c
  HAL_StatusTypeDef        status = HAL_OK;
  RCC_PeriphCLKInitTypeDef RCC_ExCLKInitStruct;

  /* Configure the SAI PLL according to the requested audio frequency if not already done by other instances */
  if ((Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) && (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET))
  {
    status = MX_SAI1_ClockConfig(&haudio_in_sai, SampleRate);
  }

  if (status == HAL_OK)
  {
    RCC_ExCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_DFSDM1AUDIO;
    RCC_ExCLKInitStruct.Dfsdm1AudioClockSelection = RCC_DFSDM1AUDIOCLKSOURCE_SAI1;
    status = HAL_RCCEx_PeriphCLKConfig(&RCC_ExCLKInitStruct);
  }

  return status;
}

/**
  * @brief  Initialize DFSDM1.
  * @param  hDfsdmFilter  DFSDM filter handle.
  * @param  hDfsdmChannel DFSDM channel handle.
  * @param  MXInit DFSDM configuration structure.
  * @retval HAL_status.
  */
__weak HAL_StatusTypeDef MX_DFSDM1_Init(DFSDM_Filter_HandleTypeDef *hDfsdmFilter, DFSDM_Channel_HandleTypeDef *hDfsdmChannel, MX_DFSDM_InitTypeDef *MXInit)
{  
  HAL_StatusTypeDef status = HAL_OK;
  
  /* MIC channels initialization */
  hDfsdmChannel->Instance                      = MXInit->ChannelInstance;  
  hDfsdmChannel->Init.OutputClock.Activation   = ENABLE;
  hDfsdmChannel->Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
  hDfsdmChannel->Init.OutputClock.Divider      = MXInit->ClockDivider;
  hDfsdmChannel->Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
  hDfsdmChannel->Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
  hDfsdmChannel->Init.Input.Pins               = MXInit->DigitalMicPins; 
  hDfsdmChannel->Init.SerialInterface.Type     = MXInit->DigitalMicType;
  hDfsdmChannel->Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
  hDfsdmChannel->Init.Awd.FilterOrder          = DFSDM_CHANNEL_SINC1_ORDER;
  hDfsdmChannel->Init.Awd.Oversampling         = 10;
  hDfsdmChannel->Init.Offset                   = 0;
  hDfsdmChannel->Init.RightBitShift            = MXInit->RightBitShift;
  
  if(HAL_OK != HAL_DFSDM_ChannelInit(hDfsdmChannel))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* MIC filters  initialization */
    hDfsdmFilter->Instance                          = MXInit->FilterInstance; 
    hDfsdmFilter->Init.RegularParam.Trigger         = MXInit->RegularTrigger;
    hDfsdmFilter->Init.RegularParam.FastMode        = ENABLE;
    hDfsdmFilter->Init.RegularParam.DmaMode         = ENABLE;
    hDfsdmFilter->Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
    hDfsdmFilter->Init.InjectedParam.ScanMode       = DISABLE;
    hDfsdmFilter->Init.InjectedParam.DmaMode        = DISABLE;
    hDfsdmFilter->Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO;
    hDfsdmFilter->Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_BOTH_EDGES;
    hDfsdmFilter->Init.FilterParam.SincOrder        = MXInit->SincOrder;
    hDfsdmFilter->Init.FilterParam.Oversampling     = MXInit->Oversampling;   
    hDfsdmFilter->Init.FilterParam.IntOversampling  = 1;

    if(HAL_DFSDM_FilterInit(hDfsdmFilter) != HAL_OK)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Configure regular channel */
      if(HAL_DFSDM_FilterConfigRegChannel(hDfsdmFilter, MXInit->Channel4Filter, DFSDM_CONTINUOUS_CONV_ON) != HAL_OK)
      {
        status = HAL_ERROR;
      }
    }
  }

  return status;
}
/**
  * @}
  */ 

/** @defgroup STM32L552E-EV_AUDIO_Private_Functions STM32L552E-EV AUDIO Private Functions
  * @{
  */ 
/**
  * @brief  Probe the CS42L51 audio codec.
  * @retval BSP status.
  */
static int32_t CS42L51_Probe(void)
{
  int32_t                  status = BSP_ERROR_NONE;
  CS42L51_IO_t             IOCtx;
  uint32_t                 cs42l51_id;
  static CS42L51_Object_t  CS42L51Obj;

  /* Configure the audio driver */
  IOCtx.Address     = AUDIO_I2C_ADDRESS;
  IOCtx.Init        = BSP_I2C1_Init;
  IOCtx.DeInit      = BSP_I2C1_DeInit;
  IOCtx.ReadReg     = BSP_I2C1_ReadReg;
  IOCtx.WriteReg    = BSP_I2C1_WriteReg;
  IOCtx.GetTick     = BSP_GetTick;

  if (CS42L51_RegisterBusIO(&CS42L51Obj, &IOCtx) != CS42L51_OK)
  {
    status = BSP_ERROR_BUS_FAILURE;
  }
  else if (CS42L51_ReadID(&CS42L51Obj, &cs42l51_id) != CS42L51_OK)
  {
    status = BSP_ERROR_COMPONENT_FAILURE;
  } 
  else if ((cs42l51_id & CS42L51_ID_MASK) != CS42L51_ID)
  {
    status = BSP_ERROR_UNKNOWN_COMPONENT;
  }
  else
  {
    Audio_Drv = (AUDIO_Drv_t *) &CS42L51_Driver;
    Audio_CompObj = &CS42L51Obj;
  }

  return status;
} 

/**
  * @brief  Initialize SAI MSP.
  * @param  hsai SAI handle.
  * @retval None.
  */
static void SAI_MspInit(SAI_HandleTypeDef *hsai)
{
  GPIO_InitTypeDef         GPIO_InitStruct;

  /* Enable SAI clock */
  AUDIO_SAI1_CLK_ENABLE();

  if (hsai->Instance == SAI1_Block_B)
  {
    /* SAI pins configuration: FS, SCK, MCLK and SD pins */
    AUDIO_SAI1_MCLK_B_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = AUDIO_SAI1_MCLK_B_GPIO_AF;
    GPIO_InitStruct.Pin       = AUDIO_SAI1_MCLK_B_GPIO_PIN;
    HAL_GPIO_Init(AUDIO_SAI1_MCLK_B_GPIO_PORT, &GPIO_InitStruct);

    AUDIO_SAI1_FS_B_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Alternate = AUDIO_SAI1_FS_B_GPIO_AF;
    GPIO_InitStruct.Pin       = AUDIO_SAI1_FS_B_GPIO_PIN;
    HAL_GPIO_Init(AUDIO_SAI1_FS_B_GPIO_PORT, &GPIO_InitStruct);

    AUDIO_SAI1_SCK_B_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Alternate = AUDIO_SAI1_SCK_B_GPIO_AF;
    GPIO_InitStruct.Pin       = AUDIO_SAI1_SCK_B_GPIO_PIN;
    HAL_GPIO_Init(AUDIO_SAI1_SCK_B_GPIO_PORT, &GPIO_InitStruct);

    AUDIO_SAI1_SD_B_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Alternate = AUDIO_SAI1_SD_B_GPIO_AF;
    GPIO_InitStruct.Pin       = AUDIO_SAI1_SD_B_GPIO_PIN;
    HAL_GPIO_Init(AUDIO_SAI1_SD_B_GPIO_PORT, &GPIO_InitStruct);

    /* Configure the hDmaSaiTx handle parameters */
    __HAL_RCC_DMA2_CLK_ENABLE();
    __HAL_RCC_DMAMUX1_CLK_ENABLE();
    hDmaSaiTx.Init.Request             = DMA_REQUEST_SAI1_B;
    hDmaSaiTx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    hDmaSaiTx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hDmaSaiTx.Init.MemInc              = DMA_MINC_ENABLE;
    if (Audio_Out_Ctx[0].BitsPerSample == AUDIO_RESOLUTION_16b)
    {
      hDmaSaiTx.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      hDmaSaiTx.Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    }
    else /* AUDIO_RESOLUTION_24b */
    {
      hDmaSaiTx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
      hDmaSaiTx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    }
    hDmaSaiTx.Init.Mode                = DMA_CIRCULAR;
    hDmaSaiTx.Init.Priority            = DMA_PRIORITY_HIGH;
    hDmaSaiTx.Instance                 = DMA2_Channel1;
    /* Associate the DMA handle */
    __HAL_LINKDMA(hsai, hdmatx, hDmaSaiTx);
    /* Deinitialize the Stream for new transfer */
    if (HAL_DMA_DeInit(&hDmaSaiTx) != HAL_OK)
    {
      /* Nothing to do */
    }
    /* Configure the DMA Stream */
    if (HAL_DMA_Init(&hDmaSaiTx) != HAL_OK)
    {
      /* Nothing to do */
    }
    /* SAI DMA IRQ Channel configuration */
    HAL_NVIC_SetPriority(DMA2_Channel1_IRQn, BSP_AUDIO_OUT_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(DMA2_Channel1_IRQn);
  }
  else /* SAI1_BlockA */
  {
    /* SAI pins configuration: SD pin */
    AUDIO_SAI1_SD_A_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = AUDIO_SAI1_SD_A_GPIO_AF;
    GPIO_InitStruct.Pin       = AUDIO_SAI1_SD_A_GPIO_PIN;
    HAL_GPIO_Init(AUDIO_SAI1_SD_A_GPIO_PORT, &GPIO_InitStruct);

