STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E-EV/stm32l552e_eval_audio.c
  /* Wait 1ms according CS42L51 datasheet */
  HAL_Delay(1);
#else /* USE_BSP_IO_CLASS == 1 */
  status = BSP_ERROR_NONE;
#endif /* USE_BSP_IO_CLASS == 1 */

  return status;
}

/**
  * @brief  Reset CS42L51.
  * @retval BSP status.
  */
static int32_t CS42L51_PowerDown(void)
{
  int32_t status;

#if (USE_BSP_IO_CLASS == 1)
  /* Reset the CS42L51 */
  status = BSP_IO_WritePin(0, IO_PIN_15, IO_PIN_RESET);
#else /* USE_BSP_IO_CLASS == 1 */
  status = BSP_ERROR_NONE;
#endif /* USE_BSP_IO_CLASS == 1 */

  return status;
}

/**
  * @brief  DeInitialize DFSDM.
  * @param  hDfsdmFilter  DFSDM filter handle.
  * @param  hDfsdmChannel DFSDM channel handle.
  * @retval BSP status.
  */
static int32_t DFSDM_DeInit(DFSDM_Filter_HandleTypeDef *hDfsdmFilter, DFSDM_Channel_HandleTypeDef *hDfsdmChannel)
{  
  int32_t status = BSP_ERROR_NONE;
  
  /* MIC filters  initialization */
  if(HAL_DFSDM_FilterDeInit(hDfsdmFilter) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    /* MIC channels Deinitialization */
    if(HAL_OK != HAL_DFSDM_ChannelDeInit(hDfsdmChannel))
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return status;
}

/**
  * @brief  Initialize DFSDM channel MSP.
  * @param  hdfsdm_channel DFSDM channel handle.
  * @retval None.
  */
static void DFSDM_ChannelMspInit(DFSDM_Channel_HandleTypeDef *hdfsdm_channel)
{
  if (((hdfsdm_channel->Instance == DFSDM1_Channel1) && ((Audio_In_Ctx[1].Device & AUDIO_IN_DIGITAL_MIC1) != 0U)) || \
      ((hdfsdm_channel->Instance == DFSDM1_Channel0) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)))
  {
    GPIO_InitTypeDef  GPIO_InitStruct;

    /* Enable DFSDM clock */
    AUDIO_DFSDM1_CLK_ENABLE();

    /* DFSDM pins configuration: DFSDM1_CKOUT, DFSDM1_DATIN1 pins */
    AUDIO_DFSDM1_CKOUT_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = AUDIO_DFSDM1_CKOUT_GPIO_AF;
    GPIO_InitStruct.Pin       = AUDIO_DFSDM1_CKOUT_GPIO_PIN;
    HAL_GPIO_Init(AUDIO_DFSDM1_CKOUT_GPIO_PORT, &GPIO_InitStruct);

    AUDIO_DFSDM1_DATIN1_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Alternate = AUDIO_DFSDM1_DATIN1_GPIO_AF;
    GPIO_InitStruct.Pin       = AUDIO_DFSDM1_DATIN1_GPIO_PIN;
    HAL_GPIO_Init(AUDIO_DFSDM1_DATIN1_GPIO_PORT, &GPIO_InitStruct);
  }
}

/**
  * @brief  DeInitialize DFSDM channel MSP.
  * @param  hdfsdm_channel DFSDM channel handle.
  * @retval None.
  */
static void DFSDM_ChannelMspDeInit(DFSDM_Channel_HandleTypeDef *hdfsdm_channel)
{
  if (((hdfsdm_channel->Instance == DFSDM1_Channel1) && ((Audio_In_Ctx[1].Device & AUDIO_IN_DIGITAL_MIC1) != 0U)) || \
      ((hdfsdm_channel->Instance == DFSDM1_Channel0) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)))
  {
    /* De-initialize DFSDM1_CKOUT, DFSDM1_DATIN1 pins */
    HAL_GPIO_DeInit(AUDIO_DFSDM1_CKOUT_GPIO_PORT, AUDIO_DFSDM1_CKOUT_GPIO_PIN);
    HAL_GPIO_DeInit(AUDIO_DFSDM1_DATIN1_GPIO_PORT, AUDIO_DFSDM1_DATIN1_GPIO_PIN);

    /* Disable DFSDM1 */
    AUDIO_DFSDM1_CLK_DISABLE();
  }
}

/**
  * @brief  Initialize DFSDM filter MSP.
  * @param  hdfsdm_filter DFSDM filter handle.
  * @retval None.
  */
static void DFSDM_FilterMspInit(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  if(hdfsdm_filter->Instance == DFSDM1_Filter0)
  {
    /* Enable the DMA clock */
    __HAL_RCC_DMA1_CLK_ENABLE();
    __HAL_RCC_DMAMUX1_CLK_ENABLE();

    /* Configure the hDmaDfsdm[0] handle parameters */
    hDmaDfsdm[0].Init.Request             = DMA_REQUEST_DFSDM1_FLT0;
    hDmaDfsdm[0].Init.Direction           = DMA_PERIPH_TO_MEMORY;
    hDmaDfsdm[0].Init.PeriphInc           = DMA_PINC_DISABLE;
    hDmaDfsdm[0].Init.MemInc              = DMA_MINC_ENABLE;
    hDmaDfsdm[0].Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hDmaDfsdm[0].Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    hDmaDfsdm[0].Init.Mode                = DMA_CIRCULAR;
    hDmaDfsdm[0].Init.Priority            = DMA_PRIORITY_HIGH;
    hDmaDfsdm[0].Instance                 = DMA1_Channel4;

    /* Associate the DMA handle */
    __HAL_LINKDMA(hdfsdm_filter, hdmaReg, hDmaDfsdm[0]);

    /* Deinitialize the DMA channel for new transfer */
    if (HAL_DMA_DeInit(&hDmaDfsdm[0]) != HAL_OK)
    {
      /* Nothing to do */
    }

    /* Configure the DMA Channel */
    if (HAL_DMA_Init(&hDmaDfsdm[0]) != HAL_OK)
    {
      /* Nothing to do */
    }

    /* DMA IRQ Channel configuration */
    HAL_NVIC_SetPriority(DMA1_Channel4_IRQn, BSP_AUDIO_IN_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel4_IRQn);
  }
  else /* DFSDM1_Filter1 */
  {
    if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)
    {
      /* Enable the DMA clock needed if only MIC2 is used */
      __HAL_RCC_DMA1_CLK_ENABLE();
      __HAL_RCC_DMAMUX1_CLK_ENABLE();
    }

    /* Configure the hDmaDfsdm[1] handle parameters */
    hDmaDfsdm[1].Init.Request             = DMA_REQUEST_DFSDM1_FLT1;
    hDmaDfsdm[1].Init.Direction           = DMA_PERIPH_TO_MEMORY;
    hDmaDfsdm[1].Init.PeriphInc           = DMA_PINC_DISABLE;
    hDmaDfsdm[1].Init.MemInc              = DMA_MINC_ENABLE;
    hDmaDfsdm[1].Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hDmaDfsdm[1].Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    hDmaDfsdm[1].Init.Mode                = DMA_CIRCULAR;
    hDmaDfsdm[1].Init.Priority            = DMA_PRIORITY_HIGH;
    hDmaDfsdm[1].Instance                 = DMA1_Channel5;

    /* Associate the DMA handle */
    __HAL_LINKDMA(hdfsdm_filter, hdmaReg, hDmaDfsdm[1]);

    /* Deinitialize the DMA channel for new transfer */
    if (HAL_DMA_DeInit(&hDmaDfsdm[1]) != HAL_OK)
    {
      /* Nothing to do */
    }

    /* Configure the DMA Channel */
    if (HAL_DMA_Init(&hDmaDfsdm[1]) != HAL_OK)
    {
      /* Nothing to do */
    }

    /* DMA IRQ Channel configuration */
    HAL_NVIC_SetPriority(DMA1_Channel5_IRQn, BSP_AUDIO_IN_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel5_IRQn);
  }
}

/**
  * @brief  DeInitialize DFSDM filter MSP.
  * @param  hdfsdm_filter DFSDM filter handle.
  * @retval None.
  */
static void DFSDM_FilterMspDeInit(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  if(hdfsdm_filter->Instance == DFSDM1_Filter0)
  {
    /* Disable DMA  Channel IRQ */
    HAL_NVIC_DisableIRQ(DMA1_Channel4_IRQn);

