STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E-EV/stm32l552e_eval_audio.c
    /* De-initialize the DMA Channel */
    if (HAL_DMA_DeInit(&hDmaDfsdm[0]) != HAL_OK)
    {
      /* Nothing to do */
    }
  }
  else /* DFSDM1_Filter1 */
  {
    /* Disable DMA  Channel IRQ */
    HAL_NVIC_DisableIRQ(DMA1_Channel5_IRQn);

    /* De-initialize the DMA Channel */
    if (HAL_DMA_DeInit(&hDmaDfsdm[1]) != HAL_OK)
    {
      /* Nothing to do */
    }
  }
}

#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
/**
  * @brief  DFSDM filter regular conversion complete callback.
  * @param  hdfsdm_filter DFSDM filter handle.
  * @retval None.
  */
static void DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  uint32_t     index;
  uint32_t     recbufsize = (Audio_In_Ctx[1].Size / (2U * Audio_In_Ctx[1].ChannelsNbr));
  __IO int32_t tmp;

  if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC)
  {
    for (index = (recbufsize / 2U); index < recbufsize; index++)
    {
      tmp = Audio_DigMic1RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[4U * index]        = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(4U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
      tmp = Audio_DigMic2RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[(4U * index) + 2U] = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(4U * index) + 3U] = (uint8_t) ((uint32_t) tmp >> 8);
    }
  }
  else if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC1)
  {
    for (index = (recbufsize / 2U); index < recbufsize; index++)
    {
      tmp = Audio_DigMic1RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
    }
  }
  else
  {
    if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)
    {
      for (index = (recbufsize / 2U); index < recbufsize; index++)
      {
        tmp = Audio_DigMic2RecBuff[index] / 256;
        tmp = SaturaLH(tmp, -32768, 32767);
        Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
        Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
      }
    }
  }

  /* Invoke 'TransferCompete' callback function */
  if(hdfsdm_filter == &haudio_in_dfsdm_filter[0])
  {
    Audio_DmaDigMic1RecBuffCplt = 1;
  }
  else
  {
    Audio_DmaDigMic2RecBuffCplt = 1;
  }

  if (((Audio_DmaDigMic1RecBuffCplt != 0U) && (Audio_DmaDigMic2RecBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC)) ||
      ((Audio_DmaDigMic1RecBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC1)) ||
      ((Audio_DmaDigMic2RecBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)))
  {
    BSP_AUDIO_IN_TransferComplete_CallBack(1);
    Audio_DmaDigMic1RecBuffCplt = 0;
    Audio_DmaDigMic2RecBuffCplt = 0;
  }
}

/**
  * @brief  DFSDM filter regular conversion half complete callback.
  * @param  hdfsdm_filter DFSDM filter handle.
  * @retval None.
  */
static void DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  uint32_t     index;
  uint32_t     recbufsize = (Audio_In_Ctx[1].Size / (2U * Audio_In_Ctx[1].ChannelsNbr));
  __IO int32_t tmp;

  if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC)
  {
    for (index = 0; index < (recbufsize / 2U); index++)
    {
      tmp = Audio_DigMic1RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[4U * index]        = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(4U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
      tmp = Audio_DigMic2RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[(4U * index) + 2U] = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(4U * index) + 3U] = (uint8_t) ((uint32_t) tmp >> 8);
    }
  }
  else if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC1)
  {
    for (index = 0; index < (recbufsize / 2U); index++)
    {
      tmp = Audio_DigMic1RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
    }
  }
  else
  {
    if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)
    {
      for (index = 0; index < (recbufsize / 2U); index++)
      {
        tmp = Audio_DigMic2RecBuff[index] / 256;
        tmp = SaturaLH(tmp, -32768, 32767);
        Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
        Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
      }
    }
  }

  /* Invoke the 'HalfTransfer' callback function */
  if(hdfsdm_filter == &haudio_in_dfsdm_filter[0])
  {
    Audio_DmaDigMic1RecHalfBuffCplt = 1;
  }
  else
  {
    Audio_DmaDigMic2RecHalfBuffCplt = 1;
  }

  if (((Audio_DmaDigMic1RecHalfBuffCplt != 0U) && (Audio_DmaDigMic2RecHalfBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC)) ||
      ((Audio_DmaDigMic1RecHalfBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC1)) ||
      ((Audio_DmaDigMic2RecHalfBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)))
  {
    BSP_AUDIO_IN_HalfTransfer_CallBack(1);
    Audio_DmaDigMic1RecHalfBuffCplt = 0;
    Audio_DmaDigMic2RecHalfBuffCplt = 0;
  }
}

/**
  * @brief  DFSDM filter error callback.
  * @param  hdfsdm_filter DFSDM filter handle.
  * @retval None.
  */
static void DFSDM_FilterErrorCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  UNUSED(hdfsdm_filter);

  BSP_AUDIO_IN_Error_CallBack(1);
}
#else /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */
/**
  * @brief  DFSDM filter regular conversion complete callback.
  * @param  hdfsdm_filter DFSDM filter handle.
  * @retval None.
  */
void HAL_DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  uint32_t     index;
  uint32_t     recbufsize = (Audio_In_Ctx[1].Size / (2U * Audio_In_Ctx[1].ChannelsNbr));
  __IO int32_t tmp;

  if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC)
  {
    for (index = (recbufsize / 2U); index < recbufsize; index++)
    {
      tmp = Audio_DigMic1RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[4U * index]        = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(4U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
      tmp = Audio_DigMic2RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[(4U * index) + 2U] = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(4U * index) + 3U] = (uint8_t) ((uint32_t) tmp >> 8);
    }
  }
  else if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC1)
  {
    for (index = (recbufsize / 2U); index < recbufsize; index++)
    {
      tmp = Audio_DigMic1RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
    }
  }
  else
  {
    if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)
    {
      for (index = (recbufsize / 2U); index < recbufsize; index++)
      {
        tmp = Audio_DigMic2RecBuff[index] / 256;
        tmp = SaturaLH(tmp, -32768, 32767);
        Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
        Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
      }
    }
  }

  /* Invoke 'TransferCompete' callback function */
  if(hdfsdm_filter == &haudio_in_dfsdm_filter[0])
  {
    Audio_DmaDigMic1RecBuffCplt = 1;
  }
  else
  {
    Audio_DmaDigMic2RecBuffCplt = 1;
  }

  if (((Audio_DmaDigMic1RecBuffCplt != 0U) && (Audio_DmaDigMic2RecBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC)) ||
      ((Audio_DmaDigMic1RecBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC1)) ||
      ((Audio_DmaDigMic2RecBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)))
  {
    BSP_AUDIO_IN_TransferComplete_CallBack(1);
    Audio_DmaDigMic1RecBuffCplt = 0;
    Audio_DmaDigMic2RecBuffCplt = 0;
  }
}

/**
  * @brief  DFSDM filter regular conversion half complete callback.
  * @param  hdfsdm_filter DFSDM filter handle.
  * @retval None.
  */
void HAL_DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  uint32_t     index;
  uint32_t     recbufsize = (Audio_In_Ctx[1].Size / (2U * Audio_In_Ctx[1].ChannelsNbr));
  __IO int32_t tmp;

