STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E-EV/stm32l552e_eval_audio.c
  if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC)
  {
    for (index = 0; index < (recbufsize / 2U); index++)
    {
      tmp = Audio_DigMic1RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[4U * index]        = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(4U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
      tmp = Audio_DigMic2RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[(4U * index) + 2U] = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(4U * index) + 3U] = (uint8_t) ((uint32_t) tmp >> 8);
    }
  }
  else if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC1)
  {
    for (index = 0; index < (recbufsize / 2U); index++)
    {
      tmp = Audio_DigMic1RecBuff[index] / 256;
      tmp = SaturaLH(tmp, -32768, 32767);
      Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
      Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
    }
  }
  else
  {
    if (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)
    {
      for (index = 0; index < (recbufsize / 2U); index++)
      {
        tmp = Audio_DigMic2RecBuff[index] / 256;
        tmp = SaturaLH(tmp, -32768, 32767);
        Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
        Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t) ((uint32_t) tmp >> 8);
      }
    }
  }
  
  /* Invoke the 'HalfTransfer' callback function */
  if(hdfsdm_filter == &haudio_in_dfsdm_filter[0])
  {
    Audio_DmaDigMic1RecHalfBuffCplt = 1;
  }
  else
  {
    Audio_DmaDigMic2RecHalfBuffCplt = 1;
  }

  if (((Audio_DmaDigMic1RecHalfBuffCplt != 0U) && (Audio_DmaDigMic2RecHalfBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC)) ||
      ((Audio_DmaDigMic1RecHalfBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC1)) ||
      ((Audio_DmaDigMic2RecHalfBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DIGITAL_MIC2)))
  {
    BSP_AUDIO_IN_HalfTransfer_CallBack(1);
    Audio_DmaDigMic1RecHalfBuffCplt = 0;
    Audio_DmaDigMic2RecHalfBuffCplt = 0;
  }
}

/**
  * @brief  DFSDM filter error callback.
  * @param  hdfsdm_filter DFSDM filter handle.
  * @retval None.
  */
void HAL_DFSDM_FilterErrorCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  UNUSED(hdfsdm_filter);

  BSP_AUDIO_IN_Error_CallBack(1);
}
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
